RafaelLaya/tm4c1294ncpdt_drivers/drivers/tm4c1294ncpdt/inc/tm4c1294ncpdt_adc.h
/*
 * Rafael Laya
 * 1975274
 * April 25th, 2020
 * Contains definitions for tm4c1294ncpdt_adc.h
 */

#ifndef __TM4C1294NCPDT_ADC_H__
#define __TM4C1294NCPDT_ADC_H__

#include "tm4c1294ncpdt.h"

typedef struct {
  uint8_t Sequencer;                  /* Value from @ADC_Sequencer */
  uint8_t Sample;                     /* Value from @ADC_Sample */
  uint8_t Input;                      /* Value from @ADC_Sample_Input */
  uint8_t ITCommand;                  /* ENABLE or DISABLE */
  uint8_t EndOfSequenceCommand;       /* ENABLE or DISABLE */
  uint8_t Comparator;                 /* Value from @ADC_Sample_Comparator */
  uint8_t HoldWidth;                  /* Value from @ADC_Sample_HoldWidth */
} ADC_Sample_t;

typedef struct {
  uint8_t Comparator;                   /* Value from @ADC_Sample_Comparator */
  uint8_t ITComparisonMode;             /* Value from @ADC_ComparisonMode */
  uint8_t ITComparisonBand;             /* Value from @ADC_ComparisonBand */
  uint8_t ITComparisonCommand;          /* ENABLE or DISABLE */
  uint8_t ComparisonTriggerMode;        /* Value from @ADC_ComparisonMode */
  uint8_t ComparisonTriggerBand;        /* Value from @ADC_ComparisonBand */
  uint8_t ComparisonTriggerCommand;     /* ENABLE or DISABLE */
} ADC_Comparator_t;

/* Miscellaneous */
#define ADC_IS_PHASE(X)             ((X) >= 0U && (X) <= 15U)
#define ADC_IS_PLLVCO_DIVISOR(X)    ((X) >= 0U && (X) <= 0x3FU)

/* @ADC_ClockSource */
#define ADC_ClockSource_PLLVCO_DIV_CLKDIV     0x0U
#define ADC_ClockSource_AltClk                0x1U
#define ADC_ClockSource_MOSC                  0x2U

#define ADC_IS_CLOCKSOURCE(X)               ((X) == ADC_ClockSource_PLLVCO_DIV_CLKDIV || \
                                             (X) == ADC_ClockSource_AltClk || \
                                             (X) == ADC_ClockSource_MOSC)

/* @ADC_ComparisonBand */
#define ADC_ComparisonBand_Low                  0x0U
#define ADC_ComparisonBand_Mid                  0x1U
#define ADC_ComparisonBand_High                 0x3U

#define ADC_IS_COMPARISON_BAND(X)           ((X) >= ADC_ComparisonBand_Low && (X) <= ADC_ComparisonBand_High)

/* @ADC_ComparisonMode */
#define ADC_ComparisonMode_Always               0x0U
#define ADC_ComparisonMode_Once                 0x1U
#define ADC_ComparisonMode_HysteresisAlways     0x2U
#define ADC_ComparisonMode_HysteresisOnce       0x3U

#define ADC_IS_COMPARISON_MODE(X)         ((X) >= ADC_ComparisonMode_Always && (X) <= ADC_ComparisonMode_HysteresisOnce)

/* @ADC_Sample_Comparator */
#define ADC_Sample_Comparator0              0U
#define ADC_Sample_Comparator1              1U
#define ADC_Sample_Comparator2              2U
#define ADC_Sample_Comparator3              3U
#define ADC_Sample_Comparator4              4U
#define ADC_Sample_Comparator5              5U
#define ADC_Sample_Comparator6              6U
#define ADC_Sample_Comparator7              7U
#define ADC_Sample_Comparator_Disabled      8U

#define ADC_IS_SAMPLE_COMPARATOR(X)           ((X) >= ADC_Sample_Comparator0 && (X) <=ADC_Sample_Comparator_Disabled)

/* @ADC_Sample_HoldWidth */
#define ADC_Sample_HoldWidth4               0x0U
#define ADC_Sample_HoldWidth8               0x2U
#define ADC_Sample_HoldWidth16              0x4U
#define ADC_Sample_HoldWidth32              0x6U
#define ADC_Sample_HoldWidth64              0x8U
#define ADC_Sample_HoldWidth128             0xAU
#define ADC_Sample_HoldWidth256             0xCU

#define ADC_IS_SAMPLE_HOLDWIDTH(X)            ((X) == ADC_Sample_HoldWidth4   || \
                                               (X) == ADC_Sample_HoldWidth8   || \
                                               (X) == ADC_Sample_HoldWidth16  || \
                                               (X) == ADC_Sample_HoldWidth32  || \
                                               (X) == ADC_Sample_HoldWidth64  || \
                                               (X) == ADC_Sample_HoldWidth128 || \
                                               (X) == ADC_Sample_HoldWidth256 )

/* @ADC_Sample_Input */
#define ADC_Sample_Input_Analog0             0U
#define ADC_Sample_Input_Analog1             1U
#define ADC_Sample_Input_Analog2             2U
#define ADC_Sample_Input_Analog3             3U
#define ADC_Sample_Input_Analog4             4U
#define ADC_Sample_Input_Analog5             5U
#define ADC_Sample_Input_Analog6             6U
#define ADC_Sample_Input_Analog7             7U
#define ADC_Sample_Input_Analog8             8U
#define ADC_Sample_Input_Analog9             9U
#define ADC_Sample_Input_Analog10            10U
#define ADC_Sample_Input_Analog11            11U
#define ADC_Sample_Input_Analog12            12U
#define ADC_Sample_Input_Analog13            13U
#define ADC_Sample_Input_Analog14            14U
#define ADC_Sample_Input_Analog15            15U
#define ADC_Sample_Input_Analog16            16U
#define ADC_Sample_Input_Analog17            17U
#define ADC_Sample_Input_Analog18            18U
#define ADC_Sample_Input_Analog19            19U
#define ADC_Sample_Input_Temp                20U
#define ADC_Sample_Input_Pair0               30U
#define ADC_Sample_Input_Pair1               31U
#define ADC_Sample_Input_Pair2               32U
#define ADC_Sample_Input_Pair3               33U
#define ADC_Sample_Input_Pair4               34U
#define ADC_Sample_Input_Pair5               35U
#define ADC_Sample_Input_Pair6               36U
#define ADC_Sample_Input_Pair7               37U
#define ADC_Sample_Input_Pair8               38U
#define ADC_Sample_Input_Pair9               39U

#define ADC_IS_SAMPLE_INPUT(X)                ( ((X) >= ADC_Sample_Input_Analog0 && (X) <= ADC_Sample_Input_Temp )      || \
                                                ((X) >= ADC_Sample_Input_Pair0   && (X) <= ADC_Sample_Input_Pair9) )

/* @ADC_Sequencer */
#define ADC_Sequencer0      0U
#define ADC_Sequencer1      1U
#define ADC_Sequencer2      2U
#define ADC_Sequencer3      3U

#define ADC_IS_SEQUENCER(X)                   ((X) >= ADC_Sequencer0 && (X) <= ADC_Sequencer3)

